RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/COMPONENT_CAT1A/source/pin_packages/cyhal_psoc6_02_124_bga.c
/* Connections for: scb_uart_rts */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rts[18] = {
    {0u, 0u, P0_4, P0_4_SCB0_UART_RTS},
    {7u, 0u, P1_2, P1_2_SCB7_UART_RTS},
    {1u, 0u, P2_2, P2_2_SCB1_UART_RTS},
    {9u, 0u, P2_6, P2_6_SCB9_UART_RTS},
    {2u, 0u, P3_2, P3_2_SCB2_UART_RTS},
    {5u, 0u, P5_2, P5_2_SCB5_UART_RTS},
    {10u, 0u, P5_6, P5_6_SCB10_UART_RTS},
    {3u, 0u, P6_2, P6_2_SCB3_UART_RTS},
    {6u, 0u, P6_6, P6_6_SCB6_UART_RTS},
    {4u, 0u, P7_2, P7_2_SCB4_UART_RTS},
    {4u, 0u, P8_2, P8_2_SCB4_UART_RTS},
    {11u, 0u, P8_6, P8_6_SCB11_UART_RTS},
    {2u, 0u, P9_2, P9_2_SCB2_UART_RTS},
    {1u, 0u, P10_2, P10_2_SCB1_UART_RTS},
    {5u, 0u, P11_2, P11_2_SCB5_UART_RTS},
    {6u, 0u, P12_2, P12_2_SCB6_UART_RTS},
    {6u, 0u, P13_2, P13_2_SCB6_UART_RTS},
    {12u, 0u, P13_6, P13_6_SCB12_UART_RTS},
};

/* Connections for: scb_uart_rx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_rx[19] = {
    {0u, 0u, P0_2, P0_2_SCB0_UART_RX},
    {7u, 0u, P1_0, P1_0_SCB7_UART_RX},
    {1u, 0u, P2_0, P2_0_SCB1_UART_RX},
    {9u, 0u, P2_4, P2_4_SCB9_UART_RX},
    {2u, 0u, P3_0, P3_0_SCB2_UART_RX},
    {7u, 0u, P4_0, P4_0_SCB7_UART_RX},
    {5u, 0u, P5_0, P5_0_SCB5_UART_RX},
    {10u, 0u, P5_4, P5_4_SCB10_UART_RX},
    {3u, 0u, P6_0, P6_0_SCB3_UART_RX},
    {6u, 0u, P6_4, P6_4_SCB6_UART_RX},
    {4u, 0u, P7_0, P7_0_SCB4_UART_RX},
    {4u, 0u, P8_0, P8_0_SCB4_UART_RX},
    {11u, 0u, P8_4, P8_4_SCB11_UART_RX},
    {2u, 0u, P9_0, P9_0_SCB2_UART_RX},
    {1u, 0u, P10_0, P10_0_SCB1_UART_RX},
    {5u, 0u, P11_0, P11_0_SCB5_UART_RX},
    {6u, 0u, P12_0, P12_0_SCB6_UART_RX},
    {6u, 0u, P13_0, P13_0_SCB6_UART_RX},
    {12u, 0u, P13_4, P13_4_SCB12_UART_RX},
};

/* Connections for: scb_uart_tx */
const cyhal_resource_pin_mapping_t cyhal_pin_map_scb_uart_tx[19] = {
    {0u, 0u, P0_3, P0_3_SCB0_UART_TX},
    {7u, 0u, P1_1, P1_1_SCB7_UART_TX},
    {1u, 0u, P2_1, P2_1_SCB1_UART_TX},
    {9u, 0u, P2_5, P2_5_SCB9_UART_TX},
    {2u, 0u, P3_1, P3_1_SCB2_UART_TX},
    {7u, 0u, P4_1, P4_1_SCB7_UART_TX},
    {5u, 0u, P5_1, P5_1_SCB5_UART_TX},
    {10u, 0u, P5_5, P5_5_SCB10_UART_TX},
    {3u, 0u, P6_1, P6_1_SCB3_UART_TX},
    {6u, 0u, P6_5, P6_5_SCB6_UART_TX},
    {4u, 0u, P7_1, P7_1_SCB4_UART_TX},
    {4u, 0u, P8_1, P8_1_SCB4_UART_TX},
    {11u, 0u, P8_5, P8_5_SCB11_UART_TX},
    {2u, 0u, P9_1, P9_1_SCB2_UART_TX},
    {1u, 0u, P10_1, P10_1_SCB1_UART_TX},
    {5u, 0u, P11_1, P11_1_SCB5_UART_TX},
    {6u, 0u, P12_1, P12_1_SCB6_UART_TX},
    {6u, 0u, P13_1, P13_1_SCB6_UART_TX},
    {12u, 0u, P13_5, P13_5_SCB12_UART_TX},
};

/* Connections for: sdhc_card_cmd */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_cmd[2] = {
    {0u, 0u, P2_4, P2_4_SDHC0_CARD_CMD},
    {1u, 0u, P12_4, P12_4_SDHC1_CARD_CMD},
};

/* Connections for: sdhc_card_dat_3to0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_3to0[8] = {
    {0u, 0u, P2_0, P2_0_SDHC0_CARD_DAT_3TO00},
    {0u, 1u, P2_1, P2_1_SDHC0_CARD_DAT_3TO01},
    {0u, 2u, P2_2, P2_2_SDHC0_CARD_DAT_3TO02},
    {0u, 3u, P2_3, P2_3_SDHC0_CARD_DAT_3TO03},
    {1u, 0u, P13_0, P13_0_SDHC1_CARD_DAT_3TO00},
    {1u, 1u, P13_1, P13_1_SDHC1_CARD_DAT_3TO01},
    {1u, 2u, P13_2, P13_2_SDHC1_CARD_DAT_3TO02},
    {1u, 3u, P13_3, P13_3_SDHC1_CARD_DAT_3TO03},
};

/* Connections for: sdhc_card_dat_7to4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_dat_7to4[4] = {
    {1u, 0u, P13_4, P13_4_SDHC1_CARD_DAT_7TO40},
    {1u, 1u, P13_5, P13_5_SDHC1_CARD_DAT_7TO41},
    {1u, 2u, P13_6, P13_6_SDHC1_CARD_DAT_7TO42},
    {1u, 3u, P13_7, P13_7_SDHC1_CARD_DAT_7TO43},
};

/* Connections for: sdhc_card_detect_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_detect_n[2] = {
    {0u, 0u, P2_6, P2_6_SDHC0_CARD_DETECT_N},
    {1u, 0u, P12_1, P12_1_SDHC1_CARD_DETECT_N},
};

/* Connections for: sdhc_card_emmc_reset_n */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_emmc_reset_n[1] = {
    {1u, 0u, P12_0, P12_0_SDHC1_CARD_EMMC_RESET_N},
};

/* Connections for: sdhc_card_if_pwr_en */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_if_pwr_en[2] = {
    {0u, 0u, P3_1, P3_1_SDHC0_CARD_IF_PWR_EN},
    {1u, 0u, P12_6, P12_6_SDHC1_CARD_IF_PWR_EN},
};

/* Connections for: sdhc_card_mech_write_prot */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_card_mech_write_prot[2] = {
    {0u, 0u, P2_7, P2_7_SDHC0_CARD_MECH_WRITE_PROT},
    {1u, 0u, P12_2, P12_2_SDHC1_CARD_MECH_WRITE_PROT},
};

/* Connections for: sdhc_clk_card */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_clk_card[2] = {
    {0u, 0u, P2_5, P2_5_SDHC0_CLK_CARD},
    {1u, 0u, P12_5, P12_5_SDHC1_CLK_CARD},
};

/* Connections for: sdhc_io_volt_sel */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_io_volt_sel[2] = {
    {0u, 0u, P3_0, P3_0_SDHC0_IO_VOLT_SEL},
    {1u, 0u, P12_7, P12_7_SDHC1_IO_VOLT_SEL},
};

/* Connections for: sdhc_led_ctrl */
const cyhal_resource_pin_mapping_t cyhal_pin_map_sdhc_led_ctrl[1] = {
    {1u, 0u, P12_3, P12_3_SDHC1_LED_CTRL},
};

/* Connections for: smif_spi_clk */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_clk[1] = {
    {0u, 0u, P11_7, P11_7_SMIF_SPI_CLK},
};

/* Connections for: smif_spi_data0 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data0[1] = {
    {0u, 0u, P11_6, P11_6_SMIF_SPI_DATA0},
};

/* Connections for: smif_spi_data1 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data1[1] = {
    {0u, 0u, P11_5, P11_5_SMIF_SPI_DATA1},
};

/* Connections for: smif_spi_data2 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data2[1] = {
    {0u, 0u, P11_4, P11_4_SMIF_SPI_DATA2},
};

/* Connections for: smif_spi_data3 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data3[1] = {
    {0u, 0u, P11_3, P11_3_SMIF_SPI_DATA3},
};

/* Connections for: smif_spi_data4 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data4[1] = {
    {0u, 0u, P12_0, P12_0_SMIF_SPI_DATA4},
};

/* Connections for: smif_spi_data5 */
const cyhal_resource_pin_mapping_t cyhal_pin_map_smif_spi_data5[1] = {
    {0u, 0u, P12_1, P12_1_SMIF_SPI_DATA5},
};

